import streamlit as st

# ขั้นตอนที่ 1 : หัวข้อหน้าเว็บ (Title สีแดง)
st.markdown("# :red[❤️แอปพลิเคชันคำนวณค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลน้ำหนักและส่วนสูงของคุณ เพื่อเช็คสุขภาพเบื้องต้น")

# ขั้นตอนที่ 2  : สร้างช่องรับค่าน้ำหนัก และส่วนสูง
weight = st.number_input("กรอกค่าน้ำหนักของคุณ (กิโลกรัม):")
height_cm = st.number_input("กรอกค่าส่วนสูงของคุณ (เซนติเมตร):")

 # ขั้นตอนที่ 3 : สร้างปุ่มกดคำนวณ
if st.button("คำนวณค่า BMI 🧮"):
   # แปลงส่วนสูงจาก cm เป็น เมตร แล้วคำนวณ BMI 
   height_m = height_cm / 100
   bmi = weight / (height_m**2)

   st.write("---")
   st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

# ขั้นตอนที่ 4 : แปลผลค่า BMI ตามเกณฑ์
      if bmi < 18.5:
          st.warning("⚠️ คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม)")
      elif 18.5 <= bmi < 23.0:
          st.success("🎉 คุณมีน้ำหนักอยู่ในเกณฑ์ปกติ (สุขภาพดี)")
      elif 23.0 <= bmi < 25.0:
          st.info("💡 คุณเริ่มมีน้ำหนักเกินเกณฑ์ (ท้วม)")
      else:
          st.error("🚨 คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพและออกกำลังกาย")

st.divider()
st.write("นายอดิเทพ วงษา เลขที่ 17 ม.4/7 ⭐")
